// Задача 6: Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).

// Условно взятое число.
int a = 4;

int b = a % 2;

if (b == 1)
    Console.WriteLine("Число а - нечётное.");
else
    Console.WriteLine("Число а - чётное.");