// 1. Напишите программу, которая на вход принимает два числа и проверяет, является ли первое число квадратом второго.
// a = 25, b = 5 -> да 
// a = 2, b = 10 -> нет 
// a = 9, b = -3 -> да 
// a = -3 b = 9 -> нет

// 3. Напишите программу, которая будет выдавать название дня недели по заданному номеру.
//  3 -> Среда 
//  5 -> Пятница

int a = 5;
int b = 25;

if (a == b*b)
Console.WriteLine("yes");
else 
Console.WriteLine("no");

//int a = 1;
//int b = 1;
//Console.WriteLine("Введите число a: ")
//Console.ReadLine();
