// Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.

//Условно взятые числа.
int a = 5;
int b = 7;

if ( a > b )
    Console.WriteLine("a > b");
else
    Console.WriteLine("b > a");